notes/c++.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C++</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" type="base/favicon" href="/base/favicon.png">
<link rel="stylesheet" href="https://www.haider.gq/base/style.css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css" />
<link href="https://fonts.googleapis.com/css2?family=Roboto+Slab:wght@600&display=swap" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<header>
	  <a href='https://www.haider.gq' class='main_header'>Haider Mirza</a>
	  <nav>
	    <ul class='nav_links'>
	      <li><a href='https://www.haider.gq/about/about'>About</a></li>
	      <li><a href='https://www.haider.gq/repos/repos'>Repositories</a></li>
	      <li><a href='https://www.haider.gq/projects/projects'>Projects</a></li>
	      <li><a href='https://www.haider.gq/notes'>Notes</a></li>
	    </ul>
	  </nav>
	</header>
</div>
<div id="content" class="content">
<h1 class="title">C++</h1>

<div id="outline-container-org5a2d5df" class="outline-2">
<h2 id="org5a2d5df">C++</h2>
<div class="outline-text-2" id="text-org5a2d5df">
<p>
Ahh, c++, the insane language insane nerds use.
</p>
</div>
<div id="outline-container-orgda95742" class="outline-3">
<h3 id="orgda95742">Conventions</h3>
<div class="outline-text-3" id="text-orgda95742">
<p>
There are a few conventions in c++ that is:
<b>s<sub>foo</sub></b> and <b>m<sub>foo</sub></b>.
s_ for static objects and m_ for private member variables (private variables in a class)
</p>
</div>
</div>
<div id="outline-container-org81b158a" class="outline-3">
<h3 id="org81b158a">OpenGL</h3>
<div class="outline-text-3" id="text-org81b158a">
<p>
OpenGL, a cross-platform application programming interface for rendering 2D and 3D vector graphics. 
Your inplamentation of OpenGL is held in your GPU and is in control of your GPU manufacturer.
We can Load these functions with <a href="glad.html#ID-4952aab9-3158-4154-a04e-58f65ddfa658">GLAD</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgcd99bfe" class="outline-2">
<h2 id="orgcd99bfe">Links to this note</h2>
<div class="outline-text-2" id="text-orgcd99bfe">
<ul class="org-ul">
<li><a href="./programming.html">Programming</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
	  <div class='footer-content'>
	    <h3>Haider Mirza</h3>
	    <p>Website created by Haider Mirza</p>
	    <ul class='socials'>
	      <li><a href='https://www.github.com/Haider-Mirza'><i class='fa fa-github'></i></a></li>
	      <li><a href='mailto:x7and7@gmail.com'><i class='fa fa-envelope'></i></a></li>
	    </ul>
	  </div>
	  <div class='footer-bottom'>
	    <p>Created by Haider Mirza with orgroam in emacs</p>
	  </div>
	</footer>
</div>
</body>
</html>
